// Пользователь вводит 2 различных строки в консоль. 
// Считать эти строки и вывести их размер в консол

#include <iostream>

int main()
{
    std::cout << "Hello World!\n";
}
